# Interactive Session (2)
This Jupyter notebook is provided as a companion to help you practice your learnings in the class, and answer to the questions in the Interactive Session (2). You do not need this notebook in order to finish Interactive Session (2), but this is provided as a help for you to experiment before answering the questions.

Please note that not all queries in the cells of this notebook are supposed to run properly. Some of them will fail and you are expected to find the reason for that.

## Initial Steps

Please run the following few cells before we start. They create the required tables and insert some tuples so that we can start experimenting with them.

In [ ]:
%load_ext sql

In [ ]:
%sql sqlite:///is2.db

In [ ]:
%%sql
CREATE TABLE Students (
    sid CHAR(11),
    name CHAR(20) NOT NULL,
    school CHAR(10),
    age INTEGER,
    gpa REAL,
    PRIMARY KEY (sid)
);

In [ ]:
%%sql
CREATE TABLE Enrolled(
    stid CHAR(20),
    cid CHAR(20),
    grade CHAR(5),
    PRIMARY KEY (stid, cid),
    FOREIGN KEY (stid) REFERENCES Students(sid)
);

### Inner Join

In [ ]:
%%sql 
INSERT INTO Students(sid, name, school, age, gpa)
VALUES  ('1002', 'Aiden', 'UBC', 19, 3.5),
        ('1003', 'Alice', 'SFU', 18, 3.7),
        ('1004', 'Bob', 'UBC', 22, 3.1),
        ('1005', 'David', 'SFU', 20, 3.2),
        ('1006', 'John', 'SFU', 21, 3.1),
        ('1007', 'Mary', 'UBC', 21, 3.4),
        ('1008', 'Mike', 'SFU', 24, 3.1),
        ('1009', 'Sarah', 'UBC', 18, 3.0);
        
SELECT * FROM Students

In [ ]:
%%sql
INSERT INTO Enrolled(stid, cid, grade)
VALUES  ('1003', '120','A'),
        ('1003', '125','B'),
        ('1003', '150','A');
SELECT * from Enrolled

In [ ]:
%%sql
SELECT name, cid FROM  Students INNER JOIN Enrolled ON sid = stid;

Why do you see each name multiple times?

### LEFT Outer Join
SQLite does not support the 'RIGHT JOIN' clause* and also the 'FULL OUTER JOIN' clause. 
Therefore, we only try the 'LEFT OUTER JOIN'.

*Update Jun 2, 2023.  newer version of Sqlite now supports 'RIGHT JOIN' clause.

In [ ]:
%%sql
SELECT name,cid FROM  Students LEFT OUTER JOIN Enrolled ON sid = stid;

You can implement 'RIGHT OUTER JOIN' by changing the table orders.

In [ ]:
%%sql
SELECT name, cid FROM Enrolled LEFT OUTER JOIN Students ON sid = stid;

And 'FULL OUTER JOIN' by using 'UNION' on the two queries above:

In [ ]:
%%sql
SELECT name,cid FROM  Students LEFT OUTER JOIN Enrolled ON sid = stid
UNION
SELECT name, cid FROM Enrolled LEFT OUTER JOIN Students ON sid = stid;

### Distinct

In [ ]:
%%sql
SELECT DISTINCT gpa FROM Students;

What if you ask for attribute name as well? Would it give you all possible distinct combinations? Or will it select the first student with each distinct gpa value and pass it to you?

In [ ]:
%%sql
SELECT DISTINCT gpa, name FROM Students;

### Aggregation

In [ ]:
%%sql
SELECT count(*) FROM Students;

In [ ]:
%%sql
SELECT count(DISTINCT gpa) FROM Students;

In [ ]:
%%sql
SELECT SUM(gpa) FROM Students;

In [ ]:
%%sql
SELECT AVG(gpa) FROM Students;

In [ ]:
%%sql
SELECT MIN(gpa) FROM Students;

In [ ]:
%%sql
SELECT MAX(gpa) FROM Students

In [ ]:
%%sql
SELECT COUNT(DISTINCT gpa) FROM Students;

In [ ]:
%%sql
SELECT SUM(DISTINCT gpa) FROM Students;

In [ ]:
%%sql
SELECT AVG(gpa) FROM Students WHERE age = 19;

Note that incorrect use of aggregations in queries in some RDBMSs might not return Error, but will not results in meaningful or useful answers:

In [ ]:
%%sql
SELECT name, AVG(gpa) FROM Students;

In [ ]:
%%sql
SELECT name, AVG(DISTINCT gpa) FROM Students;

In [ ]:
%%sql
SELECT sid, count(DISTINCT gpa) FROM Students;

### Grouping

In [ ]:
%%sql
SELECT AVG(gpa) FROM Students GROUP BY age;

In [ ]:
%%sql
SELECT age, avg(gpa) FROM Students WHERE gpa > 2.5 GROUP BY age;

### Having

In [ ]:
%%sql
SELECT AVG(gpa), age
FROM Students 
WHERE gpa > 2.5
GROUP BY age
HAVING COUNT(*) >= 2;

In [ ]:
%%sql
SELECT AVG(gpa), age
FROM Students 
WHERE gpa > 2.5
GROUP BY age
HAVING age>= 24;

In [ ]:
%%sql
SELECT AVG(gpa), age
FROM Students 
WHERE gpa > 2.5
GROUP BY age
HAVING COUNT(DISTINCT gpa)>= 2;

### Additional Practice: SWITCH CASE
Using the queries below, try to figure out the format and usage for 'SWITCH CASE'.

In [ ]:
%%sql
SELECT sid, name,
CASE
    WHEN gpa >= 3.5 THEN 'A'
    WHEN gpa < 3.5 AND gpa >= 3 THEN 'B'
    WHEN gpa < 3 AND gpa >= 2.5 THEN 'C'
    WHEN gpa < 2.5 AND gpa >= 2 THEN 'D'
    When gpa < 2 THEN 'F'
END AS lettergrade
FROM Students;

In [ ]:
%%sql
SELECT sid, name, 'A' AS lettergrade FROM Students WHERE gpa >=3.5
UNION
SELECT sid, name, 'B' AS lettergrade FROM Students WHERE gpa < 3.5 AND gpa >= 3
UNION
SELECT sid, name, 'C' AS lettergrade FROM Students WHERE gpa < 3 AND gpa >= 2.5
UNION
SELECT sid, name, 'D' AS lettergrade FROM Students WHERE gpa < 2.5 AND gpa >= 2
UNION
SELECT sid, name, 'F' AS lettergrade FROM Students WHERE gpa < 2

### Clean up Steps

In [ ]:
%%sql
DROP TABLE Enrolled;
DROP TABLE Students;